---
kind: property
id: P:Autodesk.Revit.DB.ElevationMarker.CurrentViewCount
source: html/de8f6462-5392-8dc7-730f-339b2aa59973.htm
---
# Autodesk.Revit.DB.ElevationMarker.CurrentViewCount Property

The current number of views hosted by this ElevationMarker.

## Syntax (C#)
```csharp
public int CurrentViewCount { get; }
```